In [1]:
import pandas as pd

In [3]:
#Creating a dictionary 

a={ "Name":["zara","tara","karan"],
     "dept":["CSE","IT","CSE"],
      "id":["001","005","007"]}

In [5]:
#To View
df=pd.DataFrame(a)
df

    Name dept   id
0   zara  CSE  001
1   tara   IT  005
2  karan  CSE  007

In [6]:
#To view a specific column
df["dept"]

0    CSE
1     IT
2    CSE
Name: dept, dtype: object

In [7]:
#To know what type of series
type(df["dept"])

pandas.core.series.Series

In [12]:
#To Count
df.count

<bound method DataFrame.count of     Name dept   id
0   zara  CSE  001
1   tara   IT  005
2  karan  CSE  007>

In [13]:
#To display Column names
df.columns

Index(['Name', 'dept', 'id'], dtype='object')

In [20]:
#To display rows
df.iloc[0]

Name    zara
dept     CSE
id       001
Name: 0, dtype: object

In [22]:
df.iloc[0:2]

   Name dept   id
0  zara  CSE  001
1  tara   IT  005

In [23]:
df.iloc[0:3]

    Name dept   id
0   zara  CSE  001
1   tara   IT  005
2  karan  CSE  007

In [28]:
#By using loc
df.loc[[0,1],['dept','id']]

  dept   id
0  CSE  001
1   IT  005

In [29]:
#To grab a specific column
df['dept']

0    CSE
1     IT
2    CSE
Name: dept, dtype: object

In [49]:
#Indexes

df=pd.DataFrame(a)
df

    Name dept   id
0   zara  CSE  001
1   tara   IT  005
2  karan  CSE  007

In [52]:
df.set_index("dept")

       Name   id
dept
CSE    zara  001
IT     tara  005
CSE   karan  007

In [55]:
df.loc["IT","id"]

'005'

In [57]:
#To reset 
df.reset_index
df

       Name   id
dept
CSE    zara  001
IT     tara  005
CSE   karan  007

In [66]:
#Sorting
schema_df=pd.DataFrame(a)
schema_df.sort_index()

    Name dept   id
0   zara  CSE  001
1   tara   IT  005
2  karan  CSE  007

In [65]:
schema_df.sort_index(ascending=False)

    Name dept   id
2  karan  CSE  007
1   tara   IT  005
0   zara  CSE  001

In [70]:
#Filtering
df=pd.DataFrame(a)
df

    Name dept   id
0   zara  CSE  001
1   tara   IT  005
2  karan  CSE  007

In [73]:
df["dept"]="CSE"
df

    Name dept   id
0   zara  CSE  001
1   tara  CSE  005
2  karan  CSE  007

In [76]:
filt=(df["dept"]=="CSE")
df[filt]

    Name dept   id
0   zara  CSE  001
1   tara  CSE  005
2  karan  CSE  007

In [82]:
#Update Data
#Updating column names in uppercase or lowercase

df.columns=[x.upper() for x in df.columns]
df

    NAME DEPT   ID
0   zara  CSE  001
1   tara  CSE  005
2  karan  CSE  007

In [81]:
df.columns=[x.lower() for x in df.columns]
df

    name dept   id
0   zara  CSE  001
1   tara  CSE  005
2  karan  CSE  007